** Test
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.16.mceval.scm")
  ;; Test
  (set! mc-mess true)
  (mc-eval '(let ()
              (define x 1)
              (define y 2)
              (+ x y)))
#+end_src

#+RESULTS:
#+begin_example
Evaluating
(let ()
  (define x
    1)
  (define y
    2)
  (+ x y))

Evaluating
((lambda () (define x 1) (define y 2) (+ x y)))

Evaluating
(lambda ()
  (define x
    1)
  (define y
    2)
  (+ x y))

Applying
(compound-procedure () ((let ((x (quote *unassigned*)) (y (quote *unassigned*))) (set! x 1) (set! y 2) (+ x y))) <procedure-env>)
on

Evaluating
(let ((x '*unassigned*) (y '*unassigned*))
  (set! x 1)
  (set! y 2)
  (+ x y))

Evaluating
((lambda (x y) (set! x 1) (set! y 2) (+ x y)) '*unassigned* '*unassigned*)

Evaluating
'*unassigned*

Evaluating
'*unassigned*

Evaluating
(lambda (x y)
  (set! x 1)
  (set! y 2)
  (+ x y))

Applying
(compound-procedure (x y) ((set! x 1) (set! y 2) (+ x y)) <procedure-env>)
on *unassigned* *unassigned*

Evaluating
(set! x 1)

Evaluating
(set! y 2)

Evaluating
(+ x y)

Applying
(primitive #[arity-dispatched-procedure 1])
on 1 2

#+end_example
